[
    {
        "sid": "S-1-5-18",
        "name": "Local System",
        "description": "A service account that is used by the operating system."
    },
    {
        "sid": "S-1-0",
        "name": "Null Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-0-0",
        "name": "Nobody",
        "description": "No security principal."
    },
    {
        "sid": "S-1-1",
        "name": "World Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-1-0",
        "name": "Everyone",
        "description": "A group that includes all users, even anonymous users and guests. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-2",
        "name": "Local Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-3",
        "name": "Creator Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-3-0",
        "name": "Creator Owner",
        "description": "A placeholder in an inheritable access control entry (ACE) When the ACE is inherited, the system replaces this SID with the SID for the object's current owner."
    },
    {
        "sid": "S-1-3-1",
        "name": "Creator Group",
        "description": "A placeholder in an inheritable ACE. When the ACE is inherited, the system replaces this SID with the SID for the primary group of the object's current owner. The primary group is used only by the POSIX subsystem."
    },
    {
        "sid": "S-1-3-2",
        "name": "Creator Owner Server",
        "description": "SID not used in Windows 2000."
    },
    {
        "sid": "S-1-3-3",
        "name": "Creator Group Server",
        "description": "SID not used in Windows 2000."
    },
    {
        "sid": "S-1-4",
        "name": "Nonunique Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-5",
        "name": "NT Authority",
        "description": "An identifier authority."
    },
    {
        "sid": "S-1-5-1",
        "name": "Dialup",
        "description": "A group that implicitly includes all users who are logged on to the system through a dial-up connection. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-2",
        "name": "Network",
        "description": "A group that implicitly includes all users who are logged on through a network connection. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-3",
        "name": "Batch",
        "description": "A group that implicitly includes all users who have logged on through a batch queue facility such as task scheduler jobs. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-4",
        "name": "Interactive",
        "description": "A group that includes all users who have logged on interactively. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-6",
        "name": "Service",
        "description": "A group that includes all security principals that have logged on as a service. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-7",
        "name": "ANONYMOUS LOGON",
        "description": "A user who has logged on anonymously."
    },
    {
        "sid": "S-1-5-8",
        "name": "Proxy",
        "description": "SID not used in Windows 2000."
    },
    {
        "sid": "S-1-5-9",
        "name": "ENTERPRISE DOMAIN CONTROLLERS",
        "description": "A group that includes all domain controllers an Active DirectorySUP>ªdirectory service forest of domains. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-10",
        "name": "Principal Self (or Self)",
        "description": "A placeholder in an ACE on a user, group, or computer object in Active Directory. When you grant permissions to Principal Self, you grant them to the security principal represented by the object. During an access check, the operating system replaces the SID for Principal Self with the SID for the security principal represented by the object."
    },
    {
        "sid": "S-1-5-11",
        "name": "Authenticated Users",
        "description": "A group that includes all users whose identities were authenticated when they logged on. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-12",
        "name": "Restricted Code",
        "description": "SID reserved for future use."
    },
    {
        "sid": "S-1-5-13",
        "name": "Terminal Server Users",
        "description": "A group that includes all users who have logged on to a Terminal Services server. Membership is controlled by the operating system."
    },
    {
        "sid": "S-1-5-19",
        "name": "Local Service"
    },
    {
        "sid": "S-1-5-20",
        "name": "Network Service"
    },
    {
        "sid": "S-1-5-32-544",
        "name": "Administrators",
        "description": "A built-in group. After the initial installation of the operating system, the only member of the group is the Administrator account. When a computer joins a domain, the Domain Admins group is added to the Administrators group. When a server becomes a domain controller, the Enterprise Admins group also is added to the Administrators group."
    },
    {
        "sid": "S-1-5-32-545",
        "name": "Users",
        "description": "A built-in group. After the initial installation of the operating system, the only member is the Authenticated Users group. When a computer joins a domain, the Domain Users group is added to the Users group on the computer."
    },
    {
        "sid": "S-1-5-32-546",
        "name": "Guests",
        "description": "A built-in group. By default, the only member is the Guest account."
    },
    {
        "sid": "S-1-5-32-547",
        "name": "Power Users",
        "description": "A built-in group. By default, the group has no members. This group does not exist on domain controllers."
    },
    {
        "sid": "S-1-5-32-548",
        "name": "Account Operators",
        "description": "A built-in group that exists only on domain controllers. By default, the group has no members."
    },
    {
        "sid": "S-1-5-32-549",
        "name": "Server Operators",
        "description": "A built-in group that exists only on domain controllers. By default, the group has no members."
    },
    {
        "sid": "S-1-5-32-550",
        "name": "Print Operators",
        "description": "A built-in group that exists only on domain controllers. By default, the only member is the Domain Users group."
    },
    {
        "sid": "S-1-5-32-551",
        "name": "Backup Operators",
        "description": "A built-in group. By default, the group has no members."
    },
    {
        "sid": "S-1-5-32-552",
        "name": "Replicators",
        "description": "Not used in Windows 2000."
    },
    {
        "sid": "S-1-5-32-555",
        "name": "Remote Desktop Users"
    },
    {
        "sid": "S-1-5-5- X - Y",
        "name": "Logon Session",
        "description": "A logon session. The X and Y values for these SIDs uniquely identify a particular logon session."
    },
    {
        "sid": "S-1-5-113",
        "name": "Local account"
    },
    {
        "sid": "S-1-5-80-3139157870-2983391045-3678747466-658725712-1809340420",
        "name": "NT SERVICE\\WdiServiceHost"
    },
    {
        "sid": "S-1-5-114",
        "name": "Local account and member of Administrators group"
    },
    {
        "sid": "S-1-5-32-575",
        "name": "RDS Remote Access Servers",
        "description": "A Builtin Local group. Servers in this group enable users of RemoteApp programs and personal virtual desktops access to these resources. In Internet-facing deployments, these servers are typically deployed in an edge network. This group needs to be populated on servers running RD Connection Broker. RD Gateway servers and RD Web Access servers used in the deployment need to be in this group."
    },
    {
        "sid": "S-1-5-32-576",
        "name": "RDS Endpoint Servers",
        "description": "A Builtin Local group. Servers in this group run virtual machines and host sessions where users RemoteApp programs and personal virtual desktops run. This group needs to be populated on servers running RD Connection Broker. RD Session Host servers and RD Virtualization Host servers used in the deployment need to be in this group."
    },
    {
        "sid": "S-1-5-32-577",
        "name": "RDS Management Servers",
        "description": "A Builtin Local group. Servers in this group can perform routine administrative actions on servers running Remote Desktop Services. This group needs to be populated on all servers in a Remote Desktop Services deployment. The servers running the RDS Central Management service must be included in this group."
    },
    {
        "sid": "S-1-5-32-578",
        "name": "Hyper-V Administrators",
        "description": "A Builtin Local group. Members of this group have complete and unrestricted access to all features of Hyper-V."
    },
    {
        "sid": "S-1-5-32-579",
        "name": "Access Control Assistance Operators",
        "description": "A Builtin Local group. Members of this group can remotely query authorization attributes and permissions for resources on this computer."
    },
    {
        "sid": "S-1-5-32-580",
        "name": "Remote Management Users",
        "description": "A Builtin Local group. Members of this group can access WMI resources over management protocols (such as WS-Management via the Windows Remote Management service). This applies only to WMI namespaces that grant access to the user."
    },
    {
        "sid": "S-1-5-32-569",
        "name": "Cryptographic Operators",
        "description": "A Builtin Local group. Members are authorized to perform cryptographic operations."
    },
    {
        "sid": "S-1-5-32-573",
        "name": "Event Log Readers",
        "description": "A Builtin Local group. Members of this group can read event logs from local machine."
    },
    {
        "sid": "S-1-5-32-574",
        "name": "Certificate Service DCOM Access",
        "description": "A Builtin Local group. Members of this group are allowed to connect to Certification Authorities in the enterprise."
    },
    {
        "sid": "S-1-5-32-554",
        "name": "Pre-Windows 2000 Compatible Access",
        "description": "An alias added by Windows 2000. A backward compatibility group which allows read access on all users and groups in the domain."
    },
    {
        "sid": "S-1-5-32-556",
        "name": "Network Configuration Operators",
        "description": "An alias. Members in this group can have some administrative privileges to manage configuration of networking features."
    },
    {
        "sid": "S-1-5-32-557",
        "name": "Incoming Forest Trust Builders",
        "description": "An alias. Members of this group can create incoming, one-way trusts to this forest."
    },
    {
        "sid": "S-1-5-32-558",
        "name": "Performance Monitor Users",
        "description": "An alias. Members of this group have remote access to monitor this computer."
    },
    {
        "sid": "S-1-5-32-559",
        "name": "Performance Log Users",
        "description": "An alias. Members of this group have remote access to schedule logging of performance counters on this computer."
    },
    {
        "sid": "S-1-5-32-560",
        "name": "Windows Authorization Access Group",
        "description": "An alias. Members of this group have access to the computed tokenGroupsGlobalAndUniversal attribute on User objects."
    },
    {
        "sid": "S-1-5-32-561",
        "name": "Terminal Server License Servers",
        "description": "An alias. A group for Terminal Server License Servers. When Windows Server 2003 Service Pack 1 is installed, a new local group is created."
    },
    {
        "sid": "S-1-5-32-562",
        "name": "Distributed COM Users",
        "description": "An alias. A group for COM to provide computerwide access controls that govern access to all call, activation, or launch requests on the computer."
    },
    {
        "sid": "S-1-2-0",
        "name": "Local",
        "description": "A group that includes all users who have logged on locally."
    },
    {
        "sid": "S-1-2-1",
        "name": "Console Logon",
        "description": "A group that includes users who are logged on to the physical console."
    },
    {
        "sid": "S-1-3-4",
        "name": "Owner Rights",
        "description": "A group that represents the current owner of the object. When an ACE that carries this SID is applied to an object, the system ignores the implicit READ_CONTROL and WRITE_DAC permissions for the object owner."
    },
    {
        "sid": "S-1-5-5-X-Y",
        "name": "Logon Session",
        "description": "A logon session. The X and Y values for these SIDs are different for each session."
    },
    {
        "sid": "S-1-5-14",
        "name": "Remote Interactive Logon",
        "description": "A group that includes all users who have logged on through a terminal services logon."
    },
    {
        "sid": "S-1-5-15",
        "name": "This Organization",
        "description": "A group that includes all users from the same organization. Only included with AD accounts and only added by a Windows Server 2003 or later domain controller."
    },
    {
        "sid": "S-1-5-17",
        "name": "This Organization",
        "description": "An account that is used by the default Internet Information Services (IIS) user."
    },
    {
        "sid": "S-1-5-64-10",
        "name": "NTLM Authentication",
        "description": "A SID that is used when the NTLM authentication package authenticated the client"
    },
    {
        "sid": "S-1-5-64-14",
        "name": "SChannel Authentication",
        "description": "A SID that is used when the SChannel authentication package authenticated the client."
    },
    {
        "sid": "S-1-5-64-21",
        "name": "Digest Authentication",
        "description": "A SID that is used when the Digest authentication package authenticated the client."
    },
    {
        "sid": "S-1-5-80",
        "name": "NT Service",
        "description": "An NT Service account prefix"
    },
    {
        "sid": "S-1-5-83-0",
        "name": "NT VIRTUAL MACHINE\\Virtual Machines",
        "description": "A built-in group. The group is created when the Hyper-V role is installed. Membership in the group is maintained by the Hyper-V Management Service (VMMS). This group requires the \"Create Symbolic Links\" right (SeCreateSymbolicLinkPrivilege), and also the \"Log on as a Service\" right (SeServiceLogonRight)."
    },
    {
        "sid": "S-1-16-0",
        "name": "Untrusted Mandatory Level",
        "description": "An untrusted integrity level."
    },
    {
        "sid": "S-1-16-4096",
        "name": "Low Mandatory Level",
        "description": "A low integrity level."
    },
    {
        "sid": "S-1-16-8192",
        "name": "Medium Mandatory Level",
        "description": "A medium integrity level."
    },
    {
        "sid": "S-1-16-8448",
        "name": "Medium Plus Mandatory Level",
        "description": "A medium plus integrity level."
    },
    {
        "sid": "S-1-16-12288",
        "name": "High Mandatory Level",
        "description": "A high integrity level."
    },
    {
        "sid": "S-1-16-16384",
        "name": "System Mandatory Level",
        "description": "A system integrity level."
    },
    {
        "sid": "S-1-16-20480",
        "name": "Protected Process Mandatory Level",
        "description": "A protected-process integrity level."
    },
    {
        "sid": "S-1-16-28672",
        "name": "Secure Process Mandatory Level",
        "description": "A secure process integrity level."
    },
    {
        "sid": "S-1-5-90-0",
        "name": "Window Manager\\Window Manager Group",
        "description": "?"
    }
]
